{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping preload-related enhancements to ContactPage and index.html with associated components and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files including styles, config, pages, and components.",
  "frontend/index.css": "Tailwind base layer defining OKLCH design tokens, light/dark theme variables, and global background/foreground styling.",
  "frontend/index.html": "Main HTML entry with SEO meta tags, font preconnects, and preload hints for multiple hero images.",
  "frontend/src/App.tsx": "Sets up router-driven navigation wrapped in AppLayout and ErrorBoundary with reactive route updates.",
  "frontend/src/components/about/DividerFeatureList.tsx": "Renders a list of feature items separated by visual dividers.",
  "frontend/src/components/about/TeamMemberRow.tsx": "Responsive team member row showing placeholder image and text content with optional reversed layout.",
  "frontend/src/components/common/NumberTicker.tsx": "Animated number counter using IntersectionObserver and a custom hook to start counting when visible.",
  "frontend/src/components/common/PageTransition.tsx": "Applies fade or fade-slide transitions to page content, respecting reduced-motion preferences.",
  "frontend/src/components/common/RevealOnScroll.tsx": "Mount-based reveal animation wrapper with subtle or noticeable variants and optional delay.",
  "frontend/src/components/contact/ServiceSelectorAccordion.tsx": "Provides a dropdown accordion for selecting a legal service with validation styling and state-managed open/close behavior.",
  "frontend/src/components/ErrorBoundary.tsx": "Error boundary component displaying a styled fallback UI with reload option when runtime errors occur.",
  "frontend/src/components/Footer.tsx": "Footer with contact info, social links, and homepage hash-navigation logic for smooth scrolling.",
  "frontend/src/components/home/AboutApproachSection.tsx": "Renders an about section with firm overview, approach highlights, and a button navigating to the About page.",
  "frontend/src/components/home/FaqSection.tsx": "Displays an interactive FAQ accordion and injects JSON-LD schema for SEO.",
  "frontend/src/components/home/FinalCtaSection.tsx": "Shows a call-to-action section prompting users to schedule a consultation, linking to the contact page.",
  "frontend/src/components/home/HeroSection.tsx": "Implements a looping background image carousel with preloading and a button to navigate or scroll to the contact form.",
  "frontend/src/components/home/HomeNavbar.tsx": "Creates a responsive navbar with scroll detection, in-page section navigation, and mobile menu support.",
  "frontend/src/components/home/HowItWorksSection.tsx": "Displays a timeline outlining the firm’s legal process steps using a reusable timeline component.",
  "frontend/src/components/home/PartnersMarquee.tsx": "Displays a horizontally scrolling marquee of partner cards with duplicated data for seamless looping.",
  "frontend/src/components/home/PartnersSection.tsx": "Renders the partners section with a header and includes the PartnersMarquee using static partner data.",
  "frontend/src/components/home/ServicesSection.tsx": "Shows a grid of legal services with icons and navigation buttons to services and contact pages.",
  "frontend/src/components/home/TestimonialsCarousel.tsx": "Implements an auto-scrolling testimonial carousel with manual navigation and responsive snap-based scrolling.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Wraps the testimonials section with a header and embeds the TestimonialsCarousel using predefined testimonials.",
  "frontend/src/components/home/TrustIntroSection.tsx": "Displays trust indicators with icons and animated number counters in a responsive grid.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the app layout with navbar, page transition, and scroll restoration logic on route or hash changes.",
  "frontend/src/components/reui/timeline.tsx": "Re-exports a customizable timeline component system with context, items, indicators, and separators.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state, auto-refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, logout, and identity loading states. Wraps AuthClient creation and exposes status flags and identity data.",
  "frontend/src/hooks/useNumberTicker.ts": "Animates a number from 0 to a target value using an easing function when visible. Resets when hidden and manages animation frames.",
  "frontend/src/hooks/usePreloadImages.ts": "Preloads a list of image URLs and tracks when the first and all images are ready. Returns loading state and counters.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing actor and fetch state from useActor for future backend queries.",
  "frontend/src/index.css": "Global Tailwind CSS configuration defining theme variables, typography, utility classes, and light/dark mode styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with a hero image, firm values, team members, and features, preloading the hero image.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form with validation, submission simulation, and a hero image preload; includes service selection and feedback states.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage from several content sections with scroll-based reveal animations and a footer.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a styled 404 page with an alert icon and a button to navigate back home.",
  "frontend/src/pages/servicesData.ts": "Exports a list of service definitions including names, icons, and descriptions for use in the Services page.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with a hero section, practice areas grid from servicesData, and scroll reveal effects.",
  "frontend/src/router/router.ts": "Implements a simple client-side router with route registration, navigation, and subscription for path changes.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme settings, colors, fonts, layout options, and plugin integrations.",
  "project_state.json": "Tracks project status and requirements related to fixing the grey flash issue on the Contact Us page hero image."
}