{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report describing a required change to remove a specific H2 element on the About page.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend files.",
  "frontend/index.css": "Tailwind base styles with extensive CSS variable theme definitions for light and dark modes.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, and mounting the React app.",
  "frontend/src/App.tsx": "Main app component registering routes and rendering them inside an error boundary and layout.",
  "frontend/src/components/about/TeamMemberRow.tsx": "Reusable layout component for displaying a team member with image and text, supporting reversed layout.",
  "frontend/src/components/contact/ServiceSelectorAccordion.tsx": "Accordion-style dropdown listing legal services and allowing selection with validation styling.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that displays a styled fallback UI with reload option.",
  "frontend/src/components/Footer.tsx": "Footer with contact info, social links, and hash‑based navigation to homepage sections.",
  "frontend/src/components/home/AboutApproachSection.tsx": "Homepage About section with firm overview and a CTA linking to the About page, plus an Approach features grid.",
  "frontend/src/components/home/FaqSection.tsx": "Renders an FAQ accordion with JSON-LD structured data and keyboard-accessible toggling.",
  "frontend/src/components/home/FinalCtaSection.tsx": "Displays a contact-focused call‑to‑action section with buttons that scroll or navigate to the contact area.",
  "frontend/src/components/home/HeroSection.tsx": "Provides the homepage hero banner with consultation and contact buttons that navigate or scroll to the contact form.",
  "frontend/src/components/home/HomeNavbar.tsx": "Implements a responsive navigation bar with scroll detection, section scrolling, and mobile menu support.",
  "frontend/src/components/home/HowItWorksSection.tsx": "Shows a vertical step‑by‑step outline of the legal service process.",
  "frontend/src/components/home/PartnersSection.tsx": "Displays a grid of partner organizations with names and categories.",
  "frontend/src/components/home/ServicesSection.tsx": "Renders a services grid with icons and navigation handlers for exploring services or scrolling to the contact section.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Displays a testimonials section with client quotes in a responsive card grid.",
  "frontend/src/components/home/TrustIntroSection.tsx": "Shows key trust indicators with icons and animated entries highlighting experience and results.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main layout with a navbar and smooth hash-based scrolling after navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity authentication using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook managing authentication state and AuthClient behavior.",
  "frontend/src/hooks/useQueries.ts": "Exposes actor and fetch status as a placeholder for future backend query hooks.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, theming variables, and utility classes for the frontend.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with firm values, team member listings, distinctive features, and navigation handlers for contact and services.",
  "frontend/src/pages/ContactPage.tsx": "Implements a consultation form with validation, submission handling, and UI sections for contact details and service selection.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage by rendering multiple marketing sections including hero, services, testimonials, and a final CTA.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 page with messaging and a button to navigate back to the homepage.",
  "frontend/src/pages/servicesData.ts": "Exports an array of service definitions including name, icon, and description for use in the services page.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a services overview with a hero section, service grid from servicesData, and a CTA button linking to the contact page.",
  "frontend/src/router/router.ts": "Defines a simple client-side router with path registration, navigation, subscription, and resolution logic.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, plugins, colors, fonts, and component styling settings.",
  "project_state.json": "Tracks project metadata, feature requests, and known issues regarding removing a specific H2 element on the About page. Contains versioning info, existing features, pending requests, and project configuration flags."
}