{
  "backend/main.mo": "Minimal Motoko canister actor with no methods defined.",
  "feature_evidence.json": "JSON report describing a frontend feature requiring replacement of a navbar logo image with a text node.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files describing styling, components, and behavior.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, dark mode tokens, and global element styles.",
  "frontend/index.html": "HTML entry file with SEO meta tags, Google Fonts preconnects, and preloaded hero and logo images.",
  "frontend/src/App.tsx": "Registers app routes and renders them inside AppLayout with an ErrorBoundary and router subscription for updates.",
  "frontend/src/components/about/DividerFeatureList.tsx": "Displays a vertical list of feature items separated by horizontal dividers.",
  "frontend/src/components/about/TeamMemberRow.tsx": "Responsive row layout for showcasing a team member with optional reversed orientation and placeholder image area.",
  "frontend/src/components/common/NumberTicker.tsx": "Animated number counter that triggers on visibility using IntersectionObserver and a custom ticker hook.",
  "frontend/src/components/common/PageTransition.tsx": "Wrapper adding fade or fade-slide transitions on mount, respecting reduced-motion preferences.",
  "frontend/src/components/common/RevealOnScroll.tsx": "Applies delayed reveal-on-mount animations with subtle or noticeable variants, bypassing animation if reduced motion is enabled.",
  "frontend/src/components/contact/ServiceSelectorAccordion.tsx": "A dropdown accordion letting users select a legal service, with validation styling and state-managed open/close behavior.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a styled fallback UI with reload option.",
  "frontend/src/components/Footer.tsx": "Footer component with contact info, social links, and smart homepage hash navigation handling.",
  "frontend/src/components/home/AboutApproachSection.tsx": "Renders the firm overview and approach section with descriptive items and a button navigating to the About page.",
  "frontend/src/components/home/FaqSection.tsx": "Displays an interactive FAQ accordion and embeds JSON-LD structured FAQ schema for SEO.",
  "frontend/src/components/home/FinalCtaSection.tsx": "A call‑to‑action section prompting users to schedule a consultation, linking to the contact page.",
  "frontend/src/components/home/HeroSection.tsx": "A hero banner with an auto‑advancing, seamlessly looping background carousel and a consultation navigation button.",
  "frontend/src/components/home/HomeNavbar.tsx": "A responsive navigation bar with scroll detection, section scrolling, and navigation to home or contact pages.",
  "frontend/src/components/home/HowItWorksSection.tsx": "A step‑by‑step legal process timeline using timeline UI components.",
  "frontend/src/components/home/PartnersMarquee.tsx": "Renders a horizontally scrolling marquee of partner cards using duplicated partner data for continuous looping.",
  "frontend/src/components/home/PartnersSection.tsx": "Defines a static partners list and displays it within a styled section using PartnersMarquee.",
  "frontend/src/components/home/ServicesSection.tsx": "Shows a grid of predefined legal services with icons and navigation buttons for exploring more or contacting.",
  "frontend/src/components/home/TestimonialsCarousel.tsx": "Implements an auto-scrolling, manually controllable testimonials carousel with responsive card layout.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Displays a testimonials section header and renders TestimonialsCarousel with static testimonial data.",
  "frontend/src/components/home/TrustIntroSection.tsx": "Shows trust indicators with icons and animated number counters in a responsive grid layout.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides global page layout with navbar, scroll restoration on route changes, and page transitions.",
  "frontend/src/components/reui/timeline.tsx": "Re-exports customizable timeline components with context-aware orientation handling and UI primitives.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider wrapping Dfinity AuthClient, exposing identity state, login, logout, and status helpers.",
  "frontend/src/hooks/useNumberTicker.ts": "Animates a number from 0 to a target using easing when visible, resetting when hidden.",
  "frontend/src/hooks/usePreloadImages.ts": "Preloads image URLs and tracks first-image readiness, total loaded count, and overall loading state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing actor and fetch status from useActor for future backend queries.",
  "frontend/src/index.css": "Defines global Tailwind styles, CSS variables for themes, typography, layout utilities, and component classes.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with React Query and Internet Identity providers before rendering.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with a hero image, values, team members, feature highlights, and preloaded imagery.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, simulated submission, image preloading, and service selection UI.",
  "frontend/src/pages/HomePage.tsx": "Composes the Home page using multiple content sections wrapped in reveal animations.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 page with an error message and a button to navigate back home.",
  "frontend/src/pages/servicesData.ts": "Defines the Service interface and exports an array of service objects with names, icons, and descriptions.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with a hero section, practice areas grid using servicesData, and navigation to the contact page.",
  "frontend/src/router/router.ts": "Implements a simple client-side router with route registration, navigation, and a React hook for path updates.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, fonts, plugins, and container settings for the project.",
  "project_state.json": "Tracks project state, known issues, and pending feature requests including replacing the navbar logo image with text."
}