{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing two frontend-related features and associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend source files.",
  "frontend/index.css": "Tailwind base/styles defining OKLCH color variables, dark mode values, and global background/text defaults.",
  "frontend/index.html": "Main HTML entry with SEO meta tags, font preconnects, and root mount point.",
  "frontend/src/App.tsx": "Registers client-side routes and wraps pages in AppLayout and ErrorBoundary.",
  "frontend/src/components/about/DividerFeatureList.tsx": "Renders a vertical list of features separated by dividers.",
  "frontend/src/components/about/TeamMemberRow.tsx": "Layout component for team member info with optional reversed orientation and placeholder image area.",
  "frontend/src/components/common/NumberTicker.tsx": "Animated number counter triggered on scroll using IntersectionObserver.",
  "frontend/src/components/common/PageTransition.tsx": "Wraps content with fade or fade-slide page transition respecting reduced-motion settings.",
  "frontend/src/components/common/RevealOnScroll.tsx": "Scroll-triggered reveal animation wrapper with optional delay and variant styles.",
  "frontend/src/components/contact/ServiceSelectorAccordion.tsx": "Dropdown accordion allowing users to select a legal service with error styling and click-to-toggle behavior.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a fallback UI and reload option when errors occur.",
  "frontend/src/components/Footer.tsx": "Footer with contact info, social links, and smooth-scrolling quick navigation behavior.",
  "frontend/src/components/home/AboutApproachSection.tsx": "Section describing the firm and its approach, listing key values and linking to the About page.",
  "frontend/src/components/home/FaqSection.tsx": "FAQ accordion with keyboard support and embedded JSON-LD schema for SEO.",
  "frontend/src/components/home/FinalCtaSection.tsx": "Final call‑to‑action prompting users to schedule a consultation and navigate to the contact page.",
  "frontend/src/components/home/HeroSection.tsx": "Hero carousel with preloaded background images, seamless looping, and a button linking to the contact section.",
  "frontend/src/components/home/HomeNavbar.tsx": "Responsive navbar with scroll detection, section navigation, mobile menu, and contact button.",
  "frontend/src/components/home/HowItWorksSection.tsx": "Timeline‑based section outlining the firm’s five‑step legal process.",
  "frontend/src/components/home/PartnersMarquee.tsx": "Displays a looping marquee of partner cards by duplicating the list for seamless animation.",
  "frontend/src/components/home/PartnersSection.tsx": "Renders a partners section with a header and passes a static partners list to the marquee component.",
  "frontend/src/components/home/ServicesSection.tsx": "Shows a grid of legal services with icons and navigation actions to services and contact pages.",
  "frontend/src/components/home/TestimonialsCarousel.tsx": "Implements a horizontally scrolling testimonials carousel with auto-scroll and manual navigation controls.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Displays a testimonials section header and embeds the testimonials carousel with preset data.",
  "frontend/src/components/home/TrustIntroSection.tsx": "Presents trust indicators with icons and animated number counters in a responsive grid.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main layout with navbar, page transitions, and scroll restoration on route or hash changes.",
  "frontend/src/components/reui/timeline.tsx": "Provides a set of timeline UI components with orientation support and shared context.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, logout, and status helpers.",
  "frontend/src/hooks/useNumberTicker.ts": "Implements an animated counter hook that eases from 0 to a target number when visible.",
  "frontend/src/hooks/usePreloadImages.ts": "Preloads image URLs and tracks when the first or all images have finished loading or errored.",
  "frontend/src/hooks/useQueries.ts": "Exposes actor and fetching state from useActor as a placeholder for future backend query hooks.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, typography, and component utility classes for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentity providers.",
  "frontend/src/pages/AboutPage.tsx": "Displays the firm’s mission, values, team members, and distinguishing features with navigation helpers and animated sections.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation, simulated submission, service selection, and animated hero section.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage from multiple section components with scroll‑reveal animations and a footer.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a 404 page with a message and button to navigate back home.",
  "frontend/src/pages/servicesData.ts": "Exports a list of service definitions with names, icons, and descriptions for rendering on the Services page.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with a hero section, a grid of services from servicesData, and navigation to the contact page.",
  "frontend/src/router/router.ts": "Implements a simple client-side router with path registration, navigation, listeners, and a React hook for route updates.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, plugins, colors, fonts, and utility settings for the frontend.",
  "project_state.json": "Contains the project’s metadata, features, requirements, and current state related to setting the uploaded image as the Services page hero background."
}