{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report describing three ContactPage visual update requirements and associated files/components/tests.",
  "frontend-file-summaries.txt": "Collection of autogenerated short summaries for many frontend files covering styling, components, pages, and configuration.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH design tokens, dark mode variables, and global background/foreground rules.",
  "frontend/index.html": "Main HTML entry with SEO metadata, Google Fonts preconnects, and root mount point.",
  "frontend/src/App.tsx": "Root app component registering routes and rendering pages inside AppLayout with an ErrorBoundary.",
  "frontend/src/components/about/DividerFeatureList.tsx": "Renders a list of features separated by dividers with title and description styling.",
  "frontend/src/components/about/TeamMemberRow.tsx": "Displays a team member row with optional reversed layout and placeholder image area.",
  "frontend/src/components/common/NumberTicker.tsx": "Animated number ticker using IntersectionObserver to trigger counting when visible.",
  "frontend/src/components/common/PageTransition.tsx": "Wraps children with fade or fade‑slide page transition respecting reduced‑motion settings.",
  "frontend/src/components/common/RevealOnScroll.tsx": "Scroll‑reveal wrapper that animates elements into view with optional delay and reduced‑motion bypass.",
  "frontend/src/components/contact/ServiceSelectorAccordion.tsx": "A dropdown accordion for selecting a legal service, with validation styling and dynamic option list.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary showing a styled fallback card with error details and reload button.",
  "frontend/src/components/Footer.tsx": "Footer component with contact info, social links, and smooth-scrolling quick links handling homepage vs other-page navigation.",
  "frontend/src/components/home/AboutApproachSection.tsx": "Renders the firm's overview and approach details with icons and a button that navigates to the About page.",
  "frontend/src/components/home/FaqSection.tsx": "Displays an interactive FAQ accordion and embeds JSON-LD structured FAQ data for SEO.",
  "frontend/src/components/home/FinalCtaSection.tsx": "A call-to-action section prompting users to schedule a consultation, navigating to the contact page.",
  "frontend/src/components/home/HeroSection.tsx": "A hero banner with an auto-advancing background image carousel and a consultation navigation button.",
  "frontend/src/components/home/HomeNavbar.tsx": "A responsive navbar with scroll detection, section navigation, and mobile menu toggling.",
  "frontend/src/components/home/HowItWorksSection.tsx": "A timeline-based section explaining the firm's legal process steps.",
  "frontend/src/components/home/PartnersMarquee.tsx": "Renders a looping marquee of partner cards, duplicating the list for seamless scrolling.",
  "frontend/src/components/home/PartnersSection.tsx": "Displays a partners section with a header and passes a static partner list to the marquee component.",
  "frontend/src/components/home/ServicesSection.tsx": "Shows a grid of legal services with icons and includes navigation buttons for exploring more or contacting.",
  "frontend/src/components/home/TestimonialsCarousel.tsx": "Implements an auto-scrolling testimonials carousel with manual navigation and responsive layout.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Wraps the testimonials carousel with section styling and a header using predefined testimonial data.",
  "frontend/src/components/home/TrustIntroSection.tsx": "Presents animated trust indicators with icons and number tickers highlighting firm achievements.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the app layout with navbar, page transition wrapper, and scroll restoration on route changes.",
  "frontend/src/components/reui/timeline.tsx": "Provides a wrapper implementation of timeline components with context, orientation handling, and styled subcomponents.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using React Query, updating when Internet Identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login state and stored identities.",
  "frontend/src/hooks/useNumberTicker.ts": "Implements an animated number counter that ticks from 0 to a target when visible using requestAnimationFrame.",
  "frontend/src/hooks/usePreloadImages.ts": "Preloads an array of images and returns loading progress along with flags for first and all images being ready.",
  "frontend/src/hooks/useQueries.ts": "Simple wrapper exposing actor and fetching state from useActor as a placeholder for future query hooks.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, color variables for light/dark themes, typography, and utility classes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the App component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with values, team members, features, and navigation actions using animated sections.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission simulation, service selection, and a styled hero section.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage using multiple feature sections with scroll-reveal animations and a footer.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 page with an error message and a button to navigate back to the homepage.",
  "frontend/src/pages/servicesData.ts": "Exports a list of service definitions with names, icons, and descriptions for rendering on the Services page.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with a hero section, practice areas grid from servicesData, and a CTA, using RevealOnScroll and navigation to contact.",
  "frontend/src/router/router.ts": "Implements a simple custom client-side router with route registration, navigation, and a subscription system for updates.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and plugin integrations for the project.",
  "project_state.json": "Describes project state and requirements for applying a background image with a dark overlay on the Contact page hero section."
}