{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "JSON report describing a feature update for a navbar logo image path with associated metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend files.",
  "frontend/index.css": "Tailwind base and utility setup defining extensive CSS variables for light/dark themes and applying global styles.",
  "frontend/index.html": "Main HTML entry with SEO metadata, font preconnects, root div, and script loader.",
  "frontend/src/App.tsx": "Application root registering routes and rendering resolved pages inside AppLayout and ErrorBoundary.",
  "frontend/src/components/about/DividerFeatureList.tsx": "Component rendering a list of features separated by dividers with styled titles and descriptions.",
  "frontend/src/components/about/TeamMemberRow.tsx": "Layout component displaying a team member’s placeholder image and text, supporting reversed layout.",
  "frontend/src/components/common/NumberTicker.tsx": "Animated number ticker using IntersectionObserver to trigger counting when visible.",
  "frontend/src/components/common/PageTransition.tsx": "Wrapper applying fade or fade-slide page transition animations with reduced-motion support.",
  "frontend/src/components/common/RevealOnScroll.tsx": "Scroll-reveal wrapper that animates children into view using IntersectionObserver with subtle or noticeable variants.",
  "frontend/src/components/contact/ServiceSelectorAccordion.tsx": "A dropdown accordion for selecting a legal service, managing open state and highlighting errors.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary displaying a styled fallback UI with reload option when errors occur.",
  "frontend/src/components/Footer.tsx": "Footer component with contact info, social links, and hash-based smooth scrolling for quick links.",
  "frontend/src/components/home/AboutApproachSection.tsx": "Renders the firm's overview and approach items with a button navigating to the About page.",
  "frontend/src/components/home/FaqSection.tsx": "Displays an interactive FAQ accordion with JSON-LD structured data for SEO.",
  "frontend/src/components/home/FinalCtaSection.tsx": "A call‑to‑action section prompting users to schedule a consultation via navigation to the contact page.",
  "frontend/src/components/home/HeroSection.tsx": "Hero banner with text, image, and a consultation button that navigates or scrolls to the contact form.",
  "frontend/src/components/home/HomeNavbar.tsx": "Responsive navigation bar with scroll detection, section scrolling, and mobile menu handling.",
  "frontend/src/components/home/HowItWorksSection.tsx": "A multi‑step timeline explaining the legal support process using a timeline UI component.",
  "frontend/src/components/home/PartnersMarquee.tsx": "Renders a looping marquee of partner cards with names and categories, duplicating the list for seamless scrolling.",
  "frontend/src/components/home/PartnersSection.tsx": "Defines a partners list and displays a section header followed by the PartnersMarquee component.",
  "frontend/src/components/home/ServicesSection.tsx": "Shows a grid of predefined legal services with icons and includes navigation buttons to services and contact pages.",
  "frontend/src/components/home/TestimonialsCarousel.tsx": "Implements an auto-scrolling testimonial carousel with manual navigation and responsive scroll behavior.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Displays a testimonials section with header text and feeds static testimonial data into the carousel.",
  "frontend/src/components/home/TrustIntroSection.tsx": "Shows four trust indicators with icons and animated counters using NumberTicker.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with a navbar and page transition while handling scroll restoration and hash-based navigation.",
  "frontend/src/components/reui/timeline.tsx": "Re-exports a customizable timeline component system with context for vertical or horizontal layouts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, invalidating and refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and login status tracking.",
  "frontend/src/hooks/useNumberTicker.ts": "Implements an animated number ticker hook that counts smoothly to a target value when visible.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing actor and loading state from useActor for future backend queries.",
  "frontend/src/index.css": "Defines global styles, CSS variables, Tailwind layers, typography, and theming for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with firm values, team members, and feature sections using various layout components.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission simulation, and service selection UI.",
  "frontend/src/pages/HomePage.tsx": "Composes all homepage sections wrapped in scroll‑reveal animations and includes the footer.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 page with an error message and a button to navigate back to the homepage.",
  "frontend/src/pages/servicesData.ts": "Exports a list of service definitions including name, icon, and description for use in the services page.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the services page with a hero section, services grid using servicesData, and a CTA, using custom components and navigation.",
  "frontend/src/router/router.ts": "Implements a minimal client-side router with route registration, navigation, listeners, and a React hook wrapper.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theming, plugins, custom colors, fonts, and extended utilities.",
  "project_state.json": "Tracks project metadata, known issues, and feature requests related to fixing the navbar logo path."
}