{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report documenting the addition of 'Criminal defense' to the consultation form service selector.",
  "frontend-file-summaries.txt": "Aggregated summaries of multiple frontend files describing layout, sections, styling, and configuration.",
  "frontend/index.css": "Tailwind base layer defining theme variables, dark mode tokens, and global element styles.",
  "frontend/index.html": "HTML entry point with SEO metadata, font preconnects, and root mount for the SPA.",
  "frontend/src/App.tsx": "Main React app registering routes and wrapping routed content with AppLayout and an error boundary.",
  "frontend/src/components/contact/ServiceSelectorAccordion.tsx": "Accordion dropdown listing service options, including newly added 'Criminal defense,' with selection handling.",
  "frontend/src/components/ErrorBoundary.tsx": "Class-based React error boundary rendering a styled fallback UI and reload button on errors.",
  "frontend/src/components/Footer.tsx": "Footer with contact info, social links, and hash‑based smooth scrolling or navigation.",
  "frontend/src/components/home/AboutApproachSection.tsx": "About and approach section describing the firm and a multi‑item approach grid with styled content.",
  "frontend/src/components/home/FaqSection.tsx": "Interactive FAQ section with toggleable questions and embedded JSON-LD schema for SEO.",
  "frontend/src/components/home/FinalCtaSection.tsx": "Contact-focused call-to-action section featuring buttons that navigate or scroll to the contact area.",
  "frontend/src/components/home/HeroSection.tsx": "Hero banner with legal services messaging and buttons that navigate to or scroll to the contact page.",
  "frontend/src/components/home/HomeNavbar.tsx": "Responsive navigation bar that handles scrolling to homepage sections and mobile menu toggling.",
  "frontend/src/components/home/HowItWorksSection.tsx": "Step-by-step vertical layout describing the legal support process.",
  "frontend/src/components/home/PartnersSection.tsx": "Grid display of partner organizations with names and categories.",
  "frontend/src/components/home/ServicesSection.tsx": "Renders a services grid with icons and navigation handlers for viewing more services or contacting the firm.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Displays a grid of testimonial cards with quotes, names, and roles.",
  "frontend/src/components/home/TrustIntroSection.tsx": "Shows trust indicators with icons and animated stats highlighting experience and results.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides layout with navbar and handles hash-based scrolling on navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login handling, identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Exports a simple wrapper exposing the actor and loading state for future query hooks.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, typography, components, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with firm values, team profiles, distinctive features, and navigation actions to contact or services.",
  "frontend/src/pages/ContactPage.tsx": "Implements a consultation form with validation, submission handling, and service selection UI.",
  "frontend/src/pages/HomePage.tsx": "Composes the home page by assembling multiple marketing and informational sections plus a footer.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 error card with messaging and a button to navigate back home.",
  "frontend/src/pages/servicesData.ts": "Exports structured data describing available legal services with names, icons, and descriptions.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a grid of legal services from servicesData and includes a CTA that navigates to the contact page.",
  "frontend/src/router/router.ts": "Defines a minimal client-side router with path registration, navigation, subscription, and path resolution utilities.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, fonts, animations, and plugin usage for the project.",
  "project_state.json": "Defines the project state, including existing and new feature requests for adding a 'Criminal defense' service option to the Contact Us form. Contains metadata such as schema version, project details, and issue tracking."
}