{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping three FinalCtaSection-related updates to their referenced files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose and behavior.",
  "frontend/index.css": "Tailwind base setup defining global OKLCH theme variables, dark mode tokens, and base element styling.",
  "frontend/index.html": "Main HTML entry with SEO meta tags, font preconnects, and script mount for the React app.",
  "frontend/src/App.tsx": "Registers routes and renders them inside AppLayout with an ErrorBoundary.",
  "frontend/src/components/about/TeamMemberRow.tsx": "Responsive team member row with optional reversed layout and fallback image handling.",
  "frontend/src/components/common/NumberTicker.tsx": "Animated number ticker using IntersectionObserver to start counting when visible.",
  "frontend/src/components/contact/ServiceSelectorAccordion.tsx": "Accordion dropdown for selecting a legal service with validation styling and controlled state.",
  "frontend/src/components/ErrorBoundary.tsx": "Class-based error boundary showing a fallback card UI with reload option on errors.",
  "frontend/src/components/Footer.tsx": "Footer with contact info, social links, and hash-aware quick-link navigation logic.",
  "frontend/src/components/home/AboutApproachSection.tsx": "Renders an About and Our Approach section with descriptive text and a button that navigates to the About page.",
  "frontend/src/components/home/FaqSection.tsx": "Displays an interactive FAQ accordion and injects FAQ structured data using JSON-LD.",
  "frontend/src/components/home/FinalCtaSection.tsx": "Provides a final call‑to‑action encouraging consultation scheduling with logic to navigate or scroll to the contact section.",
  "frontend/src/components/home/HeroSection.tsx": "Shows the homepage hero with headline, CTA buttons, and navigation logic to the contact page or form.",
  "frontend/src/components/home/HomeNavbar.tsx": "Implements a responsive navbar with scrolling behavior, section navigation, mobile menu, and contact button.",
  "frontend/src/components/home/HowItWorksSection.tsx": "Displays a five‑step vertical process describing how the firm supports clients.",
  "frontend/src/components/home/PartnersSection.tsx": "Renders a grid of partner organizations with names and categories using styled badges.",
  "frontend/src/components/home/ServicesSection.tsx": "Renders a services grid with icons and navigation handlers for exploring services or scrolling to contact.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Displays a grid of testimonial cards with quotes, names, and roles.",
  "frontend/src/components/home/TrustIntroSection.tsx": "Shows animated trust indicators with icons and number tickers highlighting experience metrics.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with a navbar and handles smooth scrolling to hash targets on navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/useNumberTicker.ts": "Implements a smooth animated counter that ticks to a target number when visible.",
  "frontend/src/hooks/useQueries.ts": "Exposes actor and fetching state as a placeholder for future backend query hooks.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, typography, component classes, and utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with values, team members, and features, including navigation handlers to other pages.",
  "frontend/src/pages/ContactPage.tsx": "Implements a consultation form with validation, submission simulation, and UI sections for contact details.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage by assembling multiple section components and a footer.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 page with message and button to navigate back home.",
  "frontend/src/pages/servicesData.ts": "Exports an array of service definitions with icons, names, and descriptions.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a services overview using servicesData and includes a CTA to contact the firm.",
  "frontend/src/router/router.ts": "Implements a custom client-side router with route registration, navigation, and subscription support.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended theme values, plugins, and custom colors, fonts, and animations.",
  "project_state.json": "Defines the project's current state, including existing features, new feature requests, and metadata about the homepage CTA section updates."
}