{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping several homepage UI features to their source files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files and components for build planning.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme variables and light/dark color tokens, applying global background and border styles.",
  "frontend/index.html": "HTML entry point with SEO metadata, font preconnects, and root div mounting the React app.",
  "frontend/src/App.tsx": "Root app registering routes and rendering them inside AppLayout with an ErrorBoundary.",
  "frontend/src/components/about/TeamMemberRow.tsx": "Responsive team-member row displaying an image with fallback icon and text content, supporting reversed layout.",
  "frontend/src/components/common/NumberTicker.tsx": "Animated number ticker using IntersectionObserver to start counting when visible.",
  "frontend/src/components/contact/ServiceSelectorAccordion.tsx": "Accordion-style service selector listing predefined services and updating selection on click with validation styling.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary displaying a styled fallback error card with reload button when runtime errors occur.",
  "frontend/src/components/Footer.tsx": "Footer with contact details, social links, and smooth-scroll quick links that navigate or scroll based on current page.",
  "frontend/src/components/home/AboutApproachSection.tsx": "Renders an About section with firm overview text, approach items, and a button navigating to the About page.",
  "frontend/src/components/home/FaqSection.tsx": "Displays an FAQ list with expandable items and injects structured FAQ schema JSON-LD.",
  "frontend/src/components/home/FinalCtaSection.tsx": "Shows a final call‑to‑action section with a consultation button that navigates or scrolls to the contact area.",
  "frontend/src/components/home/HeroSection.tsx": "Provides a hero banner with text, an image, and a button that navigates to or scrolls to the contact page.",
  "frontend/src/components/home/HomeNavbar.tsx": "Implements a responsive navbar with scrolling and navigation behavior for sections and pages.",
  "frontend/src/components/home/HowItWorksSection.tsx": "Renders a step‑based timeline explaining the legal process using cards and numbered markers.",
  "frontend/src/components/home/PartnersMarquee.tsx": "Shows a looping marquee of partner cards with names and categories using a duplicated list for seamless scrolling.",
  "frontend/src/components/home/PartnersSection.tsx": "Renders a partners section with a header and marquee displaying a static list of partner names and categories.",
  "frontend/src/components/home/ServicesSection.tsx": "Displays a grid of legal services with icons and includes navigation handlers for exploring services and contacting the firm.",
  "frontend/src/components/home/TestimonialsCarousel.tsx": "Implements a horizontally scrollable testimonials carousel with responsive cards and navigation controls.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Wraps a testimonials section containing a static list of testimonials and renders the carousel component.",
  "frontend/src/components/home/TrustIntroSection.tsx": "Shows animated trust indicators using icons and a number ticker to highlight experience and achievements.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main layout with a navbar and smooth hash-based scrolling behavior on route changes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and invalidates related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context handling login, logout, stored identities, and AuthClient configuration.",
  "frontend/src/hooks/useNumberTicker.ts": "Provides an animated number-ticking hook that increments smoothly when visible.",
  "frontend/src/hooks/useQueries.ts": "Exposes actor and fetch state using useActor as a placeholder for future query hooks.",
  "frontend/src/index.css": "Sets up Tailwind layers, global CSS variables for light and dark themes, and common component/utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with firm values, team members, and feature sections, including navigation handlers.",
  "frontend/src/pages/ContactPage.tsx": "Implements a consultation form with validation, submission simulation, and UI sections for contact details.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage by rendering multiple section components and a footer.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 page with an error message and button to navigate home.",
  "frontend/src/pages/servicesData.ts": "Exports a list of service definitions with icons and descriptions for use across the site.",
  "frontend/src/pages/ServicesPage.tsx": "Renders service offerings from servicesData in a grid layout with a CTA to contact the firm.",
  "frontend/src/router/router.ts": "Defines a simple custom client-side router with route registration, navigation, and React hook integration.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theme settings, custom colors, fonts, shadows, and keyframe animations.",
  "project_state.json": "Project state file tracking UI/UX update features, pending requests, and metadata for homepage hero, Our Approach, and How It Works sections."
}