{
  "backend/main.mo": "Empty Motoko actor definition.",
  "feature_evidence.json": "Feature evidence report listing three features related to adding and wiring a Learn More button in AboutApproachSection.tsx.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing each frontend file and component.",
  "frontend/index.css": "Tailwind base styles and OKLCH‑variable theme tokens with light/dark mode values.",
  "frontend/index.html": "HTML entry point with SEO metadata and font preconnects loading the React app.",
  "frontend/src/App.tsx": "Registers routes and renders the resolved route inside AppLayout with an ErrorBoundary.",
  "frontend/src/components/contact/ServiceSelectorAccordion.tsx": "Accordion‑style service selector that toggles a list of services and reports selection changes.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays an error card with reload option on failure.",
  "frontend/src/components/Footer.tsx": "Footer with contact info, social links, and hash‑based navigation handling via smooth scroll or router.",
  "frontend/src/components/home/AboutApproachSection.tsx": "About section with overview text, a Learn More button navigating to /about, and an approach grid.",
  "frontend/src/components/home/FaqSection.tsx": "Renders an FAQ section with toggleable questions and includes JSON-LD structured data for search engines.",
  "frontend/src/components/home/FinalCtaSection.tsx": "Displays a contact CTA with buttons that scroll to or navigate to the contact section.",
  "frontend/src/components/home/HeroSection.tsx": "Shows the homepage hero with text, image, and buttons that navigate to or scroll to the contact page.",
  "frontend/src/components/home/HomeNavbar.tsx": "Implements a responsive navbar with scroll-based styling and navigation to homepage sections or routes.",
  "frontend/src/components/home/HowItWorksSection.tsx": "Presents a vertical step-by-step overview of the legal process.",
  "frontend/src/components/home/PartnersSection.tsx": "Renders a grid of partner organizations with names and categories.",
  "frontend/src/components/home/ServicesSection.tsx": "Renders a services grid with icons and navigation handlers for exploring more or scrolling to contact.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Displays a testimonials grid with client quotes using Card components.",
  "frontend/src/components/home/TrustIntroSection.tsx": "Shows trust indicators with icons and animated stats highlighting experience and results.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides a layout with navbar and smooth hash-based scrolling on route changes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and invalidates related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, creating AuthClient instances and exposing login/clear functions.",
  "frontend/src/hooks/useQueries.ts": "Exports a simple wrapper returning the actor and fetching state.",
  "frontend/src/index.css": "Defines Tailwind base styles, CSS variables, dark mode colors, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the about page with firm values, team members, features, and navigation handlers for services and contact.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission simulation, and UI sections for consultation scheduling.",
  "frontend/src/pages/HomePage.tsx": "Composes the home page by assembling multiple section components and a footer.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 message with a button to navigate back to the home page.",
  "frontend/src/pages/servicesData.ts": "Exports structured data describing legal services with names, icons, and descriptions.",
  "frontend/src/pages/ServicesPage.tsx": "Shows service offerings from servicesData and includes a CTA to navigate to the contact page.",
  "frontend/src/router/router.ts": "Provides a minimal client-side router with route registration, navigation, and subscription to path changes.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, plugins, colors, typography, and container settings.",
  "project_state.json": "Defines current project state and requested feature to add a 'Learn more about us' button linked to the About page, including existing related features and metadata."
}