{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features affecting HeroSection.tsx with metadata and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for many frontend source files.",
  "frontend/index.css": "Base Tailwind CSS setup defining theme variables, dark mode tokens, and global element styling.",
  "frontend/index.html": "Main HTML entry that loads the React app with SEO metadata and font preconnects.",
  "frontend/src/App.tsx": "Root React component configuring client-side routing and wrapping pages in AppLayout with an ErrorBoundary.",
  "frontend/src/components/about/DividerFeatureList.tsx": "Renders a list of feature items separated by visual dividers.",
  "frontend/src/components/about/TeamMemberRow.tsx": "Displays a team member entry with placeholder image area and text, supporting reversed layout.",
  "frontend/src/components/common/NumberTicker.tsx": "Animated number counter triggered on scroll using an intersection observer.",
  "frontend/src/components/common/PageTransition.tsx": "Applies fade or fade‑slide transitions to page content with reduced‑motion support.",
  "frontend/src/components/common/RevealOnScroll.tsx": "Scroll-triggered reveal animation wrapper supporting subtle or noticeable variants.",
  "frontend/src/components/contact/ServiceSelectorAccordion.tsx": "Dropdown accordion allowing users to select a legal service, with state management and error styling.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component rendering a styled fallback UI with reload option on errors.",
  "frontend/src/components/Footer.tsx": "Footer component showing contact info, social links, and smooth-scrolling quick links.",
  "frontend/src/components/home/AboutApproachSection.tsx": "About section describing the firm's overview and approach, including a learn‑more button and approach items.",
  "frontend/src/components/home/FaqSection.tsx": "FAQ accordion with toggleable questions and JSON‑LD schema generation for SEO.",
  "frontend/src/components/home/FinalCtaSection.tsx": "Call‑to‑action section prompting users to schedule a consultation, with decorative visuals and navigation.",
  "frontend/src/components/home/HeroSection.tsx": "Hero banner with background image and button that navigates or scrolls to the consultation form.",
  "frontend/src/components/home/HomeNavbar.tsx": "Responsive navbar with scroll detection, section navigation, mobile menu, and contact button.",
  "frontend/src/components/home/HowItWorksSection.tsx": "Timeline‑based explanation of the legal process steps using custom timeline components.",
  "frontend/src/components/home/PartnersMarquee.tsx": "Animated marquee displaying partner cards in a looping scroll with gradient fade edges.",
  "frontend/src/components/home/PartnersSection.tsx": "Renders a partners section with a header and passes a static partner list to PartnersMarquee.",
  "frontend/src/components/home/ServicesSection.tsx": "Displays a grid of legal services with icons and navigation handlers for exploring services or contacting.",
  "frontend/src/components/home/TestimonialsCarousel.tsx": "Implements an auto-scrolling testimonials carousel with manual navigation and responsive behavior.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Wraps a static testimonials list and renders it inside the TestimonialsCarousel with a section header.",
  "frontend/src/components/home/TrustIntroSection.tsx": "Shows trust indicators with icons and animated number counters for experience and achievements.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides page layout with navbar, route-based scroll restoration, and page transition wrapper.",
  "frontend/src/components/reui/timeline.tsx": "Re-exports a customizable timeline component set with context, orientation handling, and structural elements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading. Wraps AuthClient setup with customizable options.",
  "frontend/src/hooks/useNumberTicker.ts": "Implements an animated number ticker hook that counts smoothly to a target value when visible. Uses requestAnimationFrame with easing and resets when hidden.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing actor and loading state from useActor. Intended for future backend query integrations.",
  "frontend/src/index.css": "Global Tailwind CSS configuration defining theme variables, typography, components, and light/dark mode styles. Includes layout utilities and custom classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider. Mounts the App component and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with firm values, team members, and feature highlights. Uses navigation handlers and several display components.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact/booking form with validation, submission simulation, and service selection. Displays contact info and UI components.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage from multiple sections wrapped in scroll-based reveal animations. Ends with a footer.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a styled 404 page with navigation back to the homepage. Uses card and button UI components.",
  "frontend/src/pages/servicesData.ts": "Exports a list of service definitions with names, icons, and descriptions for rendering on the services page.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the services page with a hero section, services grid from servicesData, and a CTA, using scroll reveal and navigation.",
  "frontend/src/router/router.ts": "Implements a simple client-side router with route registration, navigation, and subscription handling.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, plugins, and container settings for the project.",
  "project_state.json": "Describes the project state, features, and pending requests for updating the homepage hero background image."
}