{
  "kind": "build_request",
  "title": "Update homepage CTA section background and remove secondary elements",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the homepage CTA section component (FinalCtaSection) so its background is white, matching the other homepage sections.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Change the background color to white ( the same white background color as the other sections in the homepage)."
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/components/home/FinalCtaSection.tsx`, the `<section id=\"contact\">` no longer uses the primary (navy) background styling and renders on a white background consistent with the rest of the homepage.",
        "Text colors within the section remain readable on a white background (no low-contrast white-on-white)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the \"Contact Us Today\" button from the homepage CTA section (FinalCtaSection), including any unused click-handler logic or imports that are only needed for that button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Remove the contact us today button entirely"
        ]
      },
      "acceptanceCriteria": [
        "The secondary CTA button labeled \"Contact Us Today\" is no longer rendered in `FinalCtaSection`.",
        "Any now-unused code related only to the removed button (e.g., handler function and icon import) is removed or refactored so there are no lint/type errors.",
        "The remaining primary button continues to work (scrolls to #contact when on the homepage and navigates to `/#contact` otherwise)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove the consultation availability text block from the homepage CTA section (FinalCtaSection).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Remove the text available for consultation...."
        ]
      },
      "acceptanceCriteria": [
        "The footer text block containing \"Available for consultations across South Africa...\" is no longer rendered in `FinalCtaSection`.",
        "The CTA section layout still has appropriate spacing after removing the text block (no awkward extra border/divider left behind)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (read-only).",
    "Do not edit files listed as immutable in SYSTEM_CONTEXT (e.g., `frontend/src/main.tsx`, Internet Identity hooks).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "No changes to backend canisters or Motoko code.",
    "No redesign of other homepage sections beyond making the CTA section match the existing white section background style.",
    "No new CTA buttons or new marketing copy beyond removing the specified elements."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}