{
  "kind": "build_request",
  "title": "Fix grey flash on Contact Us hero background image during page reload",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Ensure the Contact Us page hero background image loads instantly on page reload (no initial grey placeholder flash) by preloading the existing hero image asset and applying the preload behavior to the Contact Us page content (selected element XPath: /html[1]/body[1]/div[1]/div[1]/div[1]/main[1]/section[2]). The hero image must not be repositioned or visually altered—only the loading behavior should change.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-2",
          "recent-messages-4",
          "recent-messages-7"
        ],
        "quotes": [
          "On page reload, the background image in the hero section of the contact us page starts out as grey... And then it goes to the picture.",
          "Do not reposition the image. Just fix that reloading thing. So that the image, that background image, appears instantly.",
          "Yes it's the same image currently used there on the hero section if the contact us page"
        ]
      },
      "acceptanceCriteria": [
        "Hard-refreshing (/contact) does not show a grey hero background before the hero image appears; the background image is visible immediately on first paint or as close as technically possible with preloading (matching the Home hero experience).",
        "The Contact Us hero background image URL remains exactly the same as currently used: /assets/pexels-sora-shimazaki-5668882.jpg.",
        "No change to hero background positioning (e.g., bg-center / background-position), sizing (bg-cover), or layout spacing.",
        "Preload is implemented using the same approach already used elsewhere in the project (e.g., head preload hints and/or the existing usePreloadImages hook)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add a preload hint for the Contact Us hero background image in frontend/index.html so direct navigation/reload of the Contact Us route fetches the hero image before render.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-2"
        ],
        "quotes": [
          "The background image does not appear instantly on page reload."
        ]
      },
      "acceptanceCriteria": [
        "frontend/index.html includes a <link rel='preload' as='image' href='/assets/pexels-sora-shimazaki-5668882.jpg' /> entry alongside the other critical hero image preloads.",
        "No existing preload hints are removed."
      ]
    }
  ],
  "constraints": [
    "Do not reposition or change the visual composition of the Contact Us hero background image; only fix the loading/flash behavior.",
    "Do not edit files under frontend/src/components/ui or any other frontend.immutablePaths."
  ],
  "nonGoals": [
    "Changing the Contact Us hero copy, overlay opacity, typography, or layout.",
    "Replacing or editing the hero image asset itself."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}