{
  "kind": "build_request",
  "title": "Set uploaded image as Services page hero section background",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add the uploaded image (ChatGPT Image Feb 16, 2026, 11_49_14 AM.png) to the frontend as a static asset under `frontend/public/assets/generated/` so it can be referenced by the Services page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use this image for the background of the selected section in the services page"
        ]
      },
      "acceptanceCriteria": [
        "A new static image file exists in `frontend/public/assets/generated/` matching the required filename.",
        "The Services page can reference the image via a static path (no backend usage)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the selected Services page section at XPath `/html[1]/body[1]/div[1]/div[1]/div[1]/main[1]/section[1]` (the Hero Section in `frontend/src/pages/ServicesPage.tsx`) to use the uploaded image as a full-bleed background with responsive `cover` behavior, centered positioning, and a dark dimmed overlay layer behind the existing text to ensure readability; do not change any hero copy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "Use this image for the background of the selected section in the services page",
          "Apply changes"
        ]
      },
      "acceptanceCriteria": [
        "The first `<section>` in `frontend/src/pages/ServicesPage.tsx` renders the uploaded image as its background (cover + centered).",
        "A dark overlay is visible above the image and behind the hero content to maintain text contrast.",
        "Hero heading, divider, and paragraph text content remains unchanged.",
        "Only the selected section (Hero Section) styling is modified; the rest of the Services page layout remains visually consistent."
      ]
    }
  ],
  "constraints": [
    "Apply changes ONLY to the selected element at XPath `/html[1]/body[1]/div[1]/div[1]/div[1]/main[1]/section[1]` on the Services page.",
    "Do not change any user-facing copy in the Services page hero section.",
    "Do not edit any files under `frontend/src/components/ui` or other `frontend.immutablePaths`."
  ],
  "nonGoals": [
    "No backend changes (no Motoko canister logic changes).",
    "No changes to other pages (Home, About, Contact) beyond shared styles that are strictly necessary for the Services hero background implementation."
  ],
  "imageRequirements": {
    "required": [
      "Legal still-life photo background with scales of justice, gavel, and documents (services-hero-bg.dim_1024x1536.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}