{
  "kind": "build_request",
  "title": "Set uploaded image as homepage hero background with dark tint",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add the uploaded image `Law-firms1.jpeg` to the frontend static assets and render it as the full-cover background image of the existing homepage hero section (`frontend/src/components/home/HeroSection.tsx`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1",
          "recent-messages-user-2"
        ],
        "quotes": [
          "Put this image as the background image of the hero section",
          "Apply the change"
        ]
      },
      "acceptanceCriteria": [
        "`Law-firms1.jpeg` is present under a public static path (e.g., `frontend/public/assets/...`) so it is served at runtime without involving the backend.",
        "The hero section uses the image via CSS `background-image` (or an equivalent approach) and the image covers the hero area using `background-size: cover` and `background-position: center`.",
        "The previous solid background color does not visually block the image (i.e., the image is clearly visible behind the hero content)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply a dark tint overlay on top of the hero background image while keeping the existing hero text and CTA readable and visually unchanged in layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-3"
        ],
        "quotes": [
          "Yes dark tint."
        ]
      },
      "acceptanceCriteria": [
        "A dark overlay layer (e.g., semi-transparent black) is rendered over the background image and under the hero content.",
        "Hero heading, paragraph, and CTA button remain readable on top of the tinted background across common viewport sizes (mobile and desktop).",
        "Overlay does not block interaction with the CTA button (pointer events are not intercepted)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` (read-only component sources).",
    "Backend remains single-actor; no backend changes are required for this static hero background update."
  ],
  "nonGoals": [
    "Creating a new hero section from scratch (use the existing homepage hero section).",
    "Changing hero copy, CTA behavior, or navigation logic.",
    "Adding backend storage or upload handling for hero images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}