{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Contact page hero: full-bleed background image with dark dim overlay",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add the provided hero background image as a public static asset and apply it to the Contact page hero section background (only that section), without using the duplicate uploads.",
      "acceptanceCriteria": [
        "The Contact page hero section (first `<section>` in `ContactPage.tsx`) renders with `pexels-sora-shimazaki-5668882.jpg` as its background.",
        "The other two uploaded duplicate images are not used by the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/pexels-sora-shimazaki-5668882.jpg",
          "operation": "create",
          "description": "Add the uploaded image file as a static public asset so it can be referenced by the Contact page hero background."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update only the first <section> (Hero Section) to reference the static asset at frontend/public/assets/pexels-sora-shimazaki-5668882.jpg as its background image, and ensure no references are added to pexels-sora-shimazaki-5668882-1.jpg or pexels-sora-shimazaki-5668882-2.jpg."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the Contact hero section full-bleed with responsive cover/center background behavior and add a dark overlay layer behind the text for readability.",
      "acceptanceCriteria": [
        "On mobile and desktop, the background image fills the entire hero section area without tiling or stretching artifacts (uses a cover-like behavior).",
        "A dark dimming overlay is visible over the background image, and hero text remains clearly readable (sufficient contrast).",
        "The overlay does not affect layout or interactivity of hero content (text remains selectable/clickable as expected)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Within the first <section> only, implement full-bleed background behavior (cover + centered, no-repeat) and add an overlay layer (e.g., an absolutely-positioned element) above the image but below hero content, with appropriate stacking context so the text remains interactive."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Preserve the existing hero copy and maintain current site styling consistency while applying only the new hero background/overlay changes, avoiding regressions in other Contact sections.",
      "acceptanceCriteria": [
        "Hero title, divider, and description copy remain unchanged.",
        "No visual regressions are introduced to non-selected sections of the Contact page (e.g., the contact form section styles remain the same)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Adjust only styling/layout wrappers inside the first <section> as needed to keep the existing heading (“Book Now”), accent divider, and description visually consistent and readable over the new background/overlay, without changing any text and without modifying the later Contact Form section."
        }
      ]
    }
  ]
}