{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Set Services page hero background to uploaded static image with dim overlay",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add the uploaded hero background image to the frontend as a generated static asset for Services page use.",
      "acceptanceCriteria": [
        "A new static image file exists in `frontend/public/assets/generated/` matching the required filename.",
        "The Services page can reference the image via a static path (no backend usage)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/ChatGPT Image Feb 16, 2026, 11_49_14 AM.png",
          "operation": "create",
          "description": "Add the provided uploaded image to the generated static assets folder so it can be referenced directly by the Services page via a static path."
        },
        {
          "path": "frontend/public/assets/generated/services-hero-bg.dim_1024x1536.png",
          "operation": "create",
          "description": "Add the required generated image asset `frontend/public/assets/generated/services-hero-bg.dim_1024x1536.png` (from imageRequirements) for use as the Services hero background static asset."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update only the Services page hero section to render the uploaded image as a full-bleed cover background with a dark overlay behind existing text, without changing copy.",
      "acceptanceCriteria": [
        "The first `<section>` in `frontend/src/pages/ServicesPage.tsx` renders the uploaded image as its background (cover + centered).",
        "A dark overlay is visible above the image and behind the hero content to maintain text contrast.",
        "Hero heading, divider, and paragraph text content remains unchanged.",
        "Only the selected section (Hero Section) styling is modified; the rest of the Services page layout remains visually consistent."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Modify only the first (Hero) `<section>` to use a full-bleed background image (static asset under `frontend/public/assets/generated/`, using cover and centered positioning) and add a dark overlay layer behind the existing hero content to preserve readability, without changing any hero copy or altering other sections."
        }
      ]
    }
  ]
}