{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Set homepage hero background image with dark tint overlay",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add Law-firms1.jpeg as a public static asset and use it as the existing homepage HeroSection full-cover background.",
      "acceptanceCriteria": [
        "`Law-firms1.jpeg` is present under a public static path (e.g., `frontend/public/assets/...`) so it is served at runtime without involving the backend.",
        "The hero section uses the image via CSS `background-image` (or an equivalent approach) and the image covers the hero area using `background-size: cover` and `background-position: center`.",
        "The previous solid background color does not visually block the image (i.e., the image is clearly visible behind the hero content)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/Law-firms1.jpeg",
          "operation": "create",
          "description": "Add the uploaded image file to the public static assets so it can be referenced at runtime by the HeroSection background without backend involvement."
        },
        {
          "path": "frontend/src/components/home/HeroSection.tsx",
          "operation": "modify",
          "description": "Update the existing hero section root container to render `frontend/public/assets/Law-firms1.jpeg` as a CSS background image with full-cover behavior (centered and covering the hero area), ensuring the previous solid background does not obscure the image."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a dark tint overlay over the hero background image without changing layout and keeping CTA interaction intact.",
      "acceptanceCriteria": [
        "A dark overlay layer (e.g., semi-transparent black) is rendered over the background image and under the hero content.",
        "Hero heading, paragraph, and CTA button remain readable on top of the tinted background across common viewport sizes (mobile and desktop).",
        "Overlay does not block interaction with the CTA button (pointer events are not intercepted)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/home/HeroSection.tsx",
          "operation": "modify",
          "description": "Add an overlay layer positioned between the hero background image and the hero content (e.g., an absolutely positioned semi-transparent dark layer) while keeping the existing text/CTA layout unchanged; ensure the overlay does not intercept pointer events so the CTA remains clickable."
        }
      ]
    }
  ]
}